#include<iostream>
#include"UI.h"
using namespace std;


void UI()
{
	cout << endl << endl;
	cout << "              ★★★★★★★★★★★★★★★★★★★★★★★★ " << endl;
	cout << "             ★★★★★★★                      ★★★★★★★" << endl;
	cout << "            ★★★★      欢迎使用学生成绩管理系统      ★★★★" << endl;
	cout << "             ★★★★★★★                      ★★★★★★★ " << endl;
	cout << "              ★★★★★★★★★★★★★★★★★★★★★★★★   " << endl;
	cout << "              ★                                            ★ " << endl;
	cout << "              ★                  数据操作                  ★ " << endl;
	cout << "              ★============================================★ " << endl;
	cout << "              ★        0 添加学生      1 删除学生          ★ " << endl;
	cout << "              ★        2 添加功课      3 删除功课          ★ " << endl;
	cout << "              ★        4 输入分数      5 统计成绩          ★" << endl;
	cout << "              ★============================================★" << endl;
	cout << "              ★                  生成文件                  ★   " << endl;
	cout << "              ★============================================★  " << endl;
	cout << "              ★           6 某门功课的所有成绩             ★" << endl;
	cout << "              ★           7 生成通讯录                     ★ " << endl;
	cout << "              ★           8 某个学生的成绩单               ★ " << endl;
	cout << "              ★           9 统计所有课程成绩               ★ " << endl;
	cout << "              ★============================================★ " << endl;
	cout << "              ★                  实时数据                  ★ " << endl;
	cout << "              ★============================================★  " << endl;
	cout << "              ★    10课程信息     11成绩信息   12学生信息  ★ " << endl;
	cout << "              ★                                            ★ " << endl;
	cout << "              ★★★★★★★★★★★★★★★★★★★★★★★★ " << endl;
	cout << endl; cout << endl; cout << endl;
}
